import { Dayjs } from "dayjs";

export interface  ILpr  {
    PID: string;
    IMAGE?: Uint8Array;
    PATH?: string;
    OVERVIEW?: string;
    DATETIME: Date;
    LICENSEPLATE?: string;
    PROVINCE?: string;
    CAMERA?: string;
    CROSS?: string;
    IP?: string;
    CONFIDENCE?: string;
    image_size?: string;
  };
  export interface ILprShow{
    plate: string;
    license: string;
    province: string;
    cam: string;
    time: string;
    alert: string; // This could be a URL to an image or a boolean
    name: string;
    group: string;
    location: string;
  }
  export interface ILprRecordShow{
    PID: string;
    plate: string;
    license: string;
    province: string;
    cam: string;
    time: string;
  }
  export enum ThaiProvinces {
    กรุงเทพมหานคร = "กรุงเทพมหานคร",
    กระบี่ = "กระบี่",
    กาญจนบุรี = "กาญจนบุรี",
    กาฬสินธุ์ = "กาฬสินธุ์",
    กําแพงเพชร = "กําแพงเพชร",
    ขอนแก่น = "ขอนแก่น",
    จันทบุรี = "จันทบุรี",
    ฉะเชิงเทรา = "ฉะเชิงเทรา",
    ชลบุรี = "ชลบุรี",
    ชัยนาท = "ชัยนาท",
    ชัยภูมิ = "ชัยภูมิ",
    ชุมพร = "ชุมพร",
    เชียงราย = "เชียงราย",
    เชียงใหม่ = "เชียงใหม่",
    ตรัง = "ตรัง",
    ตราด = "ตราด",
    ตาก = "ตาก",
    นครนายก = "นครนายก",
    นครปฐม = "นครปฐม",
    นครพนม = "นครพนม",
    นครราชสีมา = "นครราชสีมา",
    นครศรีธรรมราช = "นครศรีธรรมราช",
    นครสวรรค์ = "นครสวรรค์",
    นนทบุรี = "นนทบุรี",
    นราธิวาส = "นราธิวาส",
    น่าน = "น่าน",
    บุรีรัมย์ = "บุรีรัมย์",
    ปทุมธานี = "ปทุมธานี",
    ประจวบคีรีขันธ์ = "ประจวบคีรีขันธ์",
    ปราจีนบุรี = "ปราจีนบุรี",
    ปัตตานี = "ปัตตานี",
    พระนครศรีอยุธยา = "พระนครศรีอยุธยา",
    พะเยา = "พะเยา",
    พังงา = "พังงา",
    พัทลุง = "พัทลุง",
    พิจิตร = "พิจิตร",
    พิษณุโลก = "พิษณุโลก",
    เพชรบุรี = "เพชรบุรี",
    เพชรบูรณ์ = "เพชรบูรณ์",
    แพร่ = "แพร่",
    ภูเก็ต = "ภูเก็ต",
    มหาสารคาม = "มหาสารคาม",
    มุกดาหาร = "มุกดาหาร",
    แม่ฮ่องสอน = "แม่ฮ่องสอน",
    ยโสธร = "ยโสธร",
    ยะลา = "ยะลา",
    ร้อยเอ็ด = "ร้อยเอ็ด",
    ระนอง = "ระนอง",
    ระยอง = "ระยอง",
    ราชบุรี = "ราชบุรี",
    ลพบุรี = "ลพบุรี",
    ลำปาง = "ลำปาง",
    ลำพูน = "ลำพูน",
    เลย = "เลย",
    ศรีสะเกษ = "ศรีสะเกษ",
    สกลนคร = "สกลนคร",
    สงขลา = "สงขลา",
    สตูล = "สตูล",
    สมุทรปราการ = "สมุทรปราการ",
    สมุทรสงคราม = "สมุทรสงคราม",
    สมุทรสาคร = "สมุทรสาคร",
    สระแก้ว = "สระแก้ว",
    สระบุรี = "สระบุรี",
    สิงห์บุรี = "สิงห์บุรี",
    สุโขทัย = "สุโขทัย",
    สุพรรณบุรี = "สุพรรณบุรี",
    สุราษฏร์ธานี = "สุราษฏร์ธานี",
    สุรินทร์ = "สุรินทร์",
    หนองคาย = "หนองคาย",
    หนองบัวลำภู = "หนองบัวลำภู",
    อ่างทอง = "อ่างทอง",
    อุดรธานี = "อุดรธานี",
    อุตรดิตถ์ = "อุตรดิตถ์",
    อุทัยธานี = "อุทัยธานี",
    อุบลราชธานี = "อุบลราชธานี",
    อำนาจเจริญ = "อำนาจเจริญ",
    เบตง = "เบตง"
}
export interface licProSearch{
  license:string,
  province:string
}
export interface rangeDate{
  start:Dayjs | null,
  end:Dayjs | null,
}
export interface rangeDate2{
  start:Date,
  end:Date,
}